<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of FortiClient.</string>
		<key>Identifier</key>
		<string>com.github.hutr.download.FortiClientUpdate</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>FortiClientUpdate</string>
			<key>DOWNLOAD_URL</key>
			<string>https://storage.googleapis.com/munki-forticlient/FortiClient-7.0.1.0060.mpkg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>filename</key>
					<string>%NAME%.mpkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
