<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of FortiClientUpdate and creates a package.</string>
  <key>Identifier</key>
  <string>com.github.hutr.pkg.FortiClientUpdate</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>FortiClient</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>com.github.hutr.pkg.FortiClientUpdate</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
        <dict>
          <key>info_path</key>
          <string>%pathname%/FortiClient.app/Contents/Info.plist</string>
          <key>plist_keys</key>
            <dict>
              <key>CFBundleVersion</key>
              <string>version</string>
              <key>CFBundleIdentifier</key>
              <string>bundleid</string>
          </dict>
        </dict>
      <key>Processor</key>
      <string>PlistReader</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>pkgdirs</key>
        <dict>
          <key>Applications</key>
          <string>0775</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Arguments</key>
      <dict>
        <key>source_path</key>
        <string>%pathname%/FortiClient.app</string>
        <key>destination_path</key>
        <string>%pkgroot%/Applications/FortiClient.app</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_request</key>
      <dict>
        <key>pkgname</key>
        <string>%NAME%-%version%</string>
        <key>version</key>
        <string>%version%</string>
        <key>id</key>
        <string>%bundleid%</string>
         <key>options</key>
        <string>purge_ds_store</string>
        <key>chown</key>
        <array>
          <dict>
            <key>path</key>
            <string>Applications</string>
            <key>user</key>
            <string>root</string>
            <key>group</key>
            <string>admin</string>
          </dict>
        </array>
      </dict>
    </dict>
  </dict>
</array>
</dict>
</plist>
