<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of FortiClient imports into Munki.</string>
		<key>Identifier</key>
		<string>com.github.hutr.pkg.FortiClientUpdate</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>FortiClient</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>VPN</string>
				<key>description</key>
				<string>FortiClient VPN</string>
				<key>developer</key>
				<string>Fortinet</string>
				<key>display_name</key>
				<string>FortiClient</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>uninstall_method</key>
				<string>removepackages</string>
				<key>uninstallable</key>
				<false/>

				<key>items_to_copy</key>
				<array/>
				<key>minimum_os_version</key>
				<string>10.15.0</string>
				<key>name</key>
				<string>FortiClient</string>
				<key>receipts</key>
				<array/>

				<key>update_for</key>
				<array>
					<string>FortiClient</string>
				</array>

			</dict>
		</dict>

		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.hutr.download.FortiClientUpdate</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installs</key>
						<array>
							<dict>
								<key>CFBundleIdentifier</key>
								<string>com.fortinet.FortiClient</string>
								<key>CFBundleName</key>
								<string>FortiClient</string>
								<key>CFBundleShortVersionString</key>
								<string>6.4.1.1267</string>
								<key>minosversion</key>
								<string>10.15</string>
								<key>path</key>
								<string>/Applications/FortiClient.app</string>
								<key>type</key>
								<string>application</string>
								<key>version_comparison_key</key>
								<string>CFBundleShortVersionString</string>
							</dict>
						</array>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
