<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Rocket.Chat</string>
	<key>Identifier</key>
	<string>com.github.hutr.munki.RocketChat</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>RocketChat</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Rocket.Chat</string>
				<string>Rocket.Chat+</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>RocketChat - The Ultimate Open Source WebChat Platform</string>
			<key>developer</key>
			<string>Rocket.Chat</string>
			<key>display_name</key>
			<string>Rocket.Chat</string>
			<key>minimum_os_version</key>
			<string>10.9.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstallable</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hutr.download.RocketChat</string>
	<key>Process</key>
	<array>
			<dict>
					<key>Processor</key>
					<string>MunkiImporter</string>
					<key>Arguments</key>
					<dict>
							<key>pkg_path</key>
							<string>%pathname%</string>
							<key>repo_subdirectory</key>
							<string>%MUNKI_REPO_SUBDIR%</string>
							<key>version_comparison_key</key>
							<string>CFBundleVersion</string>
					</dict>
			</dict>
	</array>
</dict>
