<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Rocket.Chat+ and imports it into Munki</string>
    <key>Identifier</key>
    <string>com.github.hutr.munki.RocketChat</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RocketChat</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Rocket.Chat is a RocketChat app for macOS.</string>
            <key>developer</key>
            <string>Rocket.Chat</string>
            <key>display_name</key>
            <string>Rocket.Chat</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.9.0</string>
            <key>blocking_applications</key>
            <array>
                <string>Rocket.Chat+</string>
            </array>
            <key>unattended_install</key>
            <true/>
            <key>preinstall_script</key>
            <string>#!/bin/sh
if [ -e "/Applications/Rocket.Chat+.app" ]; then
  /bin/rm -rf "/Applications/Rocket.Chat+.app"
fi
if [ -e "/Applications/Rocket.Chat.app" ]; then
  /bin/rm -rf "/Applications/Rocket.Chat.app"
fi
exit
</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hutr.download.RocketChat</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
